<html>
    <head>
        <title>Curriculum Vitae - Alexander Moreira de Morais</title>
        <script src="./funcoes.js"></script>
        <style>
            div {
                margin-left: 20px;
            }
        </style>
    </head>
    <body onload="includeHTML()">
        <div w3-include-html="menu.html" style="all: unset"></div>
        <h2>Experi&#234;ncia Profissional</h2>
        <a target="_blank" href="https://www.linkedin.com/in/alexandermorais/">Linkedin</a>
        <div align="lef">
            <h3>T&#233;cnico Judici&#225;rio - Apoio Especializado Inform&#225;tica</h3>
            <div align="lef">
                <p>
                    <a target="_blank" href="http://trf1.jus.br">Tribunal Regional Federal da Primeira Regi&#227;o</a><br />
                    Jul 2014 &#8211; Present<br />
                    Bras&#237;lia, Distrito Federal, Brasil<br />
                    Servidor P&#250;blico Federal, atuando no apoio especializado de Infraestrutura de TI em especial na Administra&#231;&#227;o de Middleware (Servidores de aplica&#231;&#227;o e web), balanceadores de carga, otimiza&#231;&#227;o de aplica&#231;&#245;es Java Web e PHP, Administra&#231;&#227;o de redes e sistemas operacionais Unix Like.

                    <h4>Participa&#231;&#227;o em projetos estrat&#233;gicos no &#226;mbito da Justi&#231;a Federal da 1&#186; Regi&#227;o</h4>
                    <ul>
                        <li>Supervis&#227;o da Se&#231;&#227;o de Softwares Livres - SECIN/COINT/DIOPE/SESOL</li>
                        <li>Migra&#231;&#227;o de servidores Linux RHEL para CentOS</li>
                        <li>Otimiza&#231;&#227;o da arquitetura Solu&#231;&#227;o de armazenamento distribu&#237;do de arquivos anexos aos Processos Administrativos e Judiciais</li>
                        <li>Implanta&#231;&#227;o, Administra&#231;&#227;o, Monitoramento e Otimiza&#231;&#227;o dos diversos ambientes do Processo Judicial Eletr&#244;nico - PJe</li>
                        <li>Desenho da topologia de servidores de aplica&#231;&#227;o, Implanta&#231;&#227;o e Administra&#231;&#227;o do Processo Administrativo Eletr&#244;nico - SEI</li>
                    </ul>
                </p>
            </div>

            <h3>Application Server Administrator</h3>
            <div align="lef">
                <p>
                    <a target="_blank" href="http://tse.jus.br">Tribunal Superior Eleitoral</a><br />
                    Apr 2009 &#8211; May 2015<br />
                    Bras&#237;lia, Distrito Federal, Brasil<br />
                    Administrador de Servidor de Aplica&#231;&#227;o &#8211; ASA, JEE em ambiente integrado Oracle (Oracle Aplication Server 10g R2 e R3, Oracle Database Server 10g);<br />
                    Administrador do parque de Servidores de Aplica&#231;&#227;o JEE do Tribunal Superior Eleitoral - TSE, incluindo os ambientes com software de miss&#227;o cr&#237;tica como Cadastro Eleitoral (ELO), Divulga&#231;&#227;o, Presta&#231;&#227;o de Contas, Intranet e Internet;<br />
                    Especialista em Oracle Application Server, JBoss e Apache Tomcat.<br />

                    <h4>Participa&#231;&#227;o em projetos estrat&#233;gicos:</h4>
                    <ul>
                        <li>Tuning/Otimiza&#231;&#227;o de aplica&#231;&#245;es e Servidores JEE para Elei&#231;&#245;es 2010, 2012 e 2014;</li>
                        <li>Administra&#231;&#227;o dos servidores JEE em todas as UF do Brasil nas Elei&#231;&#245;es 2010, 2012 e 2014;</li>
                        <li>Migra&#231;&#227;o JEE de Apache Tomcat e Oracle Application Server para JBoss EAP;</li>
                        <li>Reestrutura&#231;&#227;o dos Servidores de Aplica&#231;&#227;o Java EE;</li>
                        <li>Autentica&#231;&#227;o Unificada e Gerenciamento de Identidades;</li>
                    </ul>
                </p>
            </div>

            <h3>Pesquisador / Desenvolvedor Web Java EE</h3>
            <div align="lef">
                <p>
                    <a target="_blank" href="https://www.gov.br/abin/pt-br">Ag&#234;ncia Brasileira de Intelig&#234;ncia - ABIN</a><br />
                    Feb 2011 &#8211; Dec 2013<br />
                    Bras&#237;lia, Distrito Federal, Brasil<br />
                    Participa&#231;&#227;o no Projeto de implanta&#231;&#227;o do Sistema Integrado de Gest&#227;o de Atividades Acad&#234;micas - SIGAA, desenvolvido pela Universidade Federal do Rio Grande do Norte - UFRN, adaptando a solu&#231;&#227;o de administra&#231;&#227;o interna e gest&#227;o de pessoas &#224; realidade da ABIN.<br />
                    Desenvolvedor Web Java EE utilizando as tecnologias Hibernate 3.2, Java Server Faces 1.2/ RichFaces 3.2, Struts 1.2, EJB 2.1, Spring 2.5;<br />
                    Administrador de Servidor de Aplica&#231;&#227;o Web Java - JBoss.
                </p>
            </div>

            <h3>Java Developer, Application Server Administrator</h3>
            <div align="lef">
                <p>
                    <a target="_blank" href="http://unimix.com.br">Unimix Tecnologia</a><br />
                    Jan 2006 &#8211; May 2010<br />
                    Bras&#237;lia, Distrito Federal, Brasil<br />
                    Consultor T&#233;cnico atuando como Administrador de Servidor de Aplica&#231;&#227;o ASA, Arquiteto de Software e Programador Web Java J2EE em ambiente integrado Oracle (Oracle Aplication Server 10g R2, Oracle JDeveloper 10g, Oracle Database Server 10g); Administra&#231;&#227;o do banco de dados e servidores de aplica&#231;&#227;o; Respons&#225;vel pelo reposit&#243;rio de versionamento Subversion; &#8216;Team Lider&#8217; da equipe de desenvolvimento. Atendimento em clientes (TSE, TST, STJ, CJF, TCU e TCDF) resolvendo chamados t&#233;cnicos e executando POC&#180;s como especialista Oracle Application Server.<br />
                </p>
            </div>

            <h3>Desenvolvedor Borland Delphi + Php</h3>
            <div align="lef">
                <p>
                    <a target="_blank" href="http://tron.com.br">Tron Inform&#225;tica</a><br />
                    May 2004 &#8211; Jan 2006<br />
                    Goi&#226;nia, Goi&#225;s, Brasil<br />
                    Programador na linguagem Delphi em toda su&#237;te TGC Contabilidade Geral, Escrita Fiscal, Livro Caixa, Lalur, Controle Patrimonial, Medicina do Trabalho, Folha de Pagamento e Ponto Eletr&#244;nico) elabora&#231;&#227;o de relat&#243;rios com Report Builder 7, Programador Web para sistemas internos na linguagem PHP, Administrador dos servidores E-mail/Internet/Rede, manuten&#231;&#227;o de servidor HTTP e FTP (remotamente), Respons&#225;vel pela manuten&#231;&#227;o da rede baseada no protocolo TCP/IP e IPX/SPX, Respons&#225;vel pelo licenciamento dos softwares Microsoft (sistema operacional Windows XP SP2, Windows Server 2003, MS Project, MS Office 2003, MS FrontPage).
                </p>
            </div>

            <h3>Desenvolvedor Borland Delphi + Php</h3>
            <div align="lef">
                <p>
                    <a target="_blank" href="https://gestcom.com.br/">Proje&#231;&#227;o Inform&#225;tica Ltda</a><br />
                    Jan 2003 &#8211; Mar 2004<br />
                    Goi&#226;nia, Goi&#225;s, Brasil<br />
                    Programador na linguagem Delphi, Programador Web na linguagem PHP, prepara&#231;&#227;o e manuten&#231;&#227;o nos servidores de Rede, Internet, E-mail, FTP e banco de dados Oracle (8i e 9i). Montagem e Configura&#231;&#227;o de Microcomputadores de clientes.
                </p>
            </div>

            <h3>Desenvolvedor CA Clipper</h3>
            <div align="lef">
                <p>
                    <a target="_blank" href="">2&#186; Tabelionato de Notas e Protestos de Piracanjuba</a><br />
                    Nov 1994 &#8211; Dez 1999<br />
                    Piracanjuba, Goi&#225;s, Brasil<br />
                    Programador na linguagem CA Clipper, prepara&#231;&#227;o e manuten&#231;&#227;o das esta&#231;&#245;es de trabalho e servidores de Rede, Internet e Arquivos. Automa&#231;&#227;o e informatiza&#231;&#227;o de rotinas e servi&#231;os Notariais, Registrais, Protesto de T&#237;tulos, Autentica&#231;&#227;o e Reconhecimento de Firmas.
                </p>
            </div>
        </div>

        <h2>Educa&#231;&#227;o</h2>
        <div align="lef">
            <h3>Centro Universit&#225;rio Anhang&#252;era</h3>
            <div align="lef">
                <p>
                    <b>Especialista em Orientacao a Objetos e Internet</b> (2006 &#8211; 2007)<br />
                    <u>P&#243;s Gradua&#231;&#227;o</u> em Orienta&#231;&#227;o a Objetos, Programa&#231;&#227;o Web, Internet, Redes de Computadores
                </p>
            </div>

            <h3>instituto Unificado de Ensino Superior Objetivo</h3>
            <div align="lef">
                <p>
                    <b>Tecn&#243;logo em Processamento de Dados</b> (2003 &#8211; 2005)<br />
                    <u>Gradua&#231;&#227;o</u> no curso superior de Tecnologia de Processamento de Dados.
                </p>
            </div>

            <h3>Ruy Brasil Cavalcanti</h3>
            <div align="lef">
                <p>
                    <b>Ensino M&#233;dio</b> (1997 &#8211; 1999)<br />
                    <u>Antigo Cient&#237;fico</u> (1&#186; ano ao 3&#186; ano)
                </p>
            </div>
        </div>

        <h2>Certifica&#231;&#245;es</h2>
        <div align="lef">
            <ul>
                <li>Oracle Linux Certified Implementation Specialist [2015]</li>
                <li>Red Hat Certified JBoss Administrator (EX248 - RHCJA \ JBCAA) [2013]</li>
                <li>Sun Certified Web Component Developer 5, SCWCD 5 [2009]</li>
                <li>Oracle Application Server 10g, OCA [2009]</li>
                <li>Sun Certified Programmer for the Java 2 Platform 1.4, SCJP [2007]</li>
            </ul>
        </div>

    </body>
</html>
